Autodesk.Revit.DB.STEPApplicationProtocol
An enumeration for STEP Application Protocols.
Since:
2025
An enumeration of available STEP Application Protocols.
Since:
2025

Autodesk.Revit.DB.STEPApplicationProtocol.ApplicationProtocol242
Managed Model Based 3D Engineering, Includes Product Manufacturing Information Protocol 242.

Autodesk.Revit.DB.STEPApplicationProtocol.ApplicationProtocol214
Automotive Design Protocol 214.

Autodesk.Revit.DB.STEPApplicationProtocol.ApplicationProtocol203
Configuration Controlled Design Protocol 203.